Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/children_s_rights_and_policy/index.html.txt.tmx
Source language: en
Languages: ga

source: Children's rights and policy
ga: Cearta leanaí agus beartas um leanaí

source: Children and rights in Ireland
ga: Leanaí agus cearta in Éirinn

source: This document gives information on a child's rights in different areas, such as, education, employment, travel, recreation, health and relationships
ga: Tugann an doiciméad seo eolas ar chearta an linbh i réimsí éagsúla lena n-áirítear oideachas, fostaíocht, taisteal, áineas, sláinte agus caidrimh

source: The Ombudsman for Children
ga: An tOmbudsman do Leanaí

source: The Ombudsman for Children promotes the rights and welfare of children in Ireland
ga: Cuireann an tOmbudsman do Leanaí cearta agus leas leanaí chun cinn

source: The Office of the Ombudsman also investigates complaints regarding children's rights
ga: Imscrúdaíonn sé/sí gearáin chomh maith. leanaí cearta leanaí

source: UN Convention on the Rights of the Child
ga: Coinbhinsiún na NA um Chearta an Linbh

source: The UN Convention on the Rights of the Child sets out the basic human rights to which children are entitled
ga: Leagtar amach i gCoinbhinsiún na NA um Cearta an Linbh na cearta bunúsacha atá leanaí i dteideal a fháil

source: National policy on children and young people
ga: An Straitéis Náisiúnta Leanaí

source: This document gives information on national policy on children and young people in Ireland and their participation in decision-making
ga: Is treoirphlean í chur feabhas a chur ar shaol na leanaí, agur ar shaol na leanaí faoi mhíbhuntáiste ach go háirithe

source: Causes of youth homelessness, also arrangements for young people who are homeless or at risk of losing their home
ga: Cúiseanna le heaspa dídine na n-óg, agus socruithe do dhaoine óga atá gan dídean nó atá i mbaol a dteach a chailleadh

source: This document is in: Housing > Losing your home
ga: This document is in: Tithíocht > Cailliúint do thí

source: Children and the criminal justice system
ga: Leanaí agus an córas ceartais choiriúil

source: The Children Act 2001 regulates the treatment of children found in breach of the criminal law
ga: Rialaíonn Acht na Leanaí 2001 conas a dhéileáiltear le leanaí a sháraíonn an dlí coiriúil

source: This document is in: Justice > Children and young offenders
ga: This document is in: Dlí > Gasúir agus Ógchiontóirí

source: The Criminal Justice Act 2006 introduced provisions for dealing with anti-social behaviour by children
ga: Thug an tAcht um Cheartas Coiriúil forálacha isteach chun déileáil le hiompar frithshóisialta déanta ag leanaí

source: These provisions allow the Gardaí to deal with anti-social behaviour in a number of ways
ga: Cuireann na forálacha sin ar chumas na nGardaí déileáil le hiompar frithshóisialta ar roinnt bealaí éagsúla

source: Diversion activities and programmes for young offenders
ga: Gníomhaíochtaí athstiúrtha agus cláir d'ógchiontóirí

source: There are diversion and other programmes which aim to help children understand the consequences of crime and keep them out of the criminal justice system
ga: Tá cláir athstiúrtha agus cláir eile ann a bhfuil sé mar aidhm acu cabhrú le páistí a thuiscint iarmhairtí na coireachta agus iad a choinneáil amach as an gcóras ceartais

source: Most Read in "Family and Relationships"
ga: Ábhar is mó éilimh i "Teaghlach agus Caidrimh"

source: Registrars of Births, Marriages and Deaths
ga: Leanaí agus cearta in Éirinn

source: Barring, safety and protection orders
ga: Orduithe Urchoisc, Sábháilteachta agus Cosanta
